# frozen_string_literal: true

brew 'mas'

brew 'jenv'

brew 'cocoapods'
brew 'git-flow'
brew 'mysql@5.7'
brew 'python@3.10'
brew 'pyenv'
brew 'pipenv'
brew 'pyenv-virtualenv'
brew 'nvm'
brew 'watchman'
brew "librsvg"
brew "graphviz"
brew "bat"
brew "neovim"
brew "asdf"
brew "fzf"
brew "fasd"

brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

brew 'tree'
brew 'openssl'
brew 'rbenv'
brew 'ruby-build'
brew 'postgresql@14'
brew 'redis'
brew 'cmake'
brew 'gh'
brew 'gdal'
brew 'lefthook'
brew 'lcov'
brew 'go'
brew 'goenv'
brew 'golangci-lint'
brew 'bundletool'

cask "fliqlo"
cask "fork"
cask "hiddenbar"
cask "itsycal"
cask "maccy"
cask "microsoft-outlook"
cask "monitorcontrol"
cask "raycast"
cask "stats"
cask "keka"
cask "appcleaner"

cask 'android-studio'
cask 'mysqlworkbench'
cask 'postman'
cask 'google-chrome'
cask 'iterm2'
cask 'figma'
cask 'pgadmin4'
cask 'google-cloud-sdk'
cask 'nosql-workbench'
cask 'local'
cask 'framer'
cask 'dbeaver-community'
tap 'mongodb/brew'
brew 'mongodb-community'
cask 'visual-studio-code'
cask 'meld'
cask 'docker'
cask 'rectangle'
tap 'leoafarias/fvm'
brew 'fvm'
