# frozen_string_literal: true

brew 'mas'

brew 'jenv'

brew 'cocoapods'
brew 'git-flow'
brew 'mysql@5.7'
brew 'python@3.8'
brew 'pyenv'
brew 'pipenv'
brew 'pyenv-virtualenv'
brew 'nvm'
brew 'watchman'
brew "graphviz"
brew 'composer'
brew 'tree'
brew 'openssl'
brew 'rbenv'
brew 'ruby-build'
brew 'git-ftp'
brew 'lftp'
brew 'gh'
brew 'gdal'
brew 'lefthook'
brew 'go'
brew 'goenv'
brew 'golangci-lint'
brew 'bundletool'
brew 'jq'
brew 'ffmpeg'

mas 'Amphetamine', id: 937984704
mas 'LINE', id: 539_883_307
mas 'KakaoTalk', id: 869_223_134
mas 'Slack', id: 803_453_959
mas 'RunCat', id: 1429033973

cask 'fork'
cask 'hiddenbar'
cask 'itsycal'
cask 'maccy'
cask 'microsoft-outlook'
cask 'monitorcontrol'
cask 'raycast'
cask 'stats'
cask 'keka'
cask 'appcleaner'
cask 'shottr'
cask 'ngrok'
cask 'android-studio'
cask 'postman'
cask 'google-chrome'
cask 'microsoft-edge'
cask 'iterm2'
cask 'karabiner-elements'
cask 'figma'
cask 'cyberduck'
cask 'visual-studio-code'
cask 'meld'
cask 'docker'
cask 'rectangle'
cask 'obsidian'

tap 'leoafarias/fvm'
brew 'fvm'
